frontend/views/layouts/main.php

        $menuItems[] = ['label' => 'Login', 'url' => ['/site/login']];

    } else {
        $menuItems[] = [
             'label' => 'Logout (' . Yii::$app->user->identity->profile->first_name . ')',
            'linkOptions' => ['data-method' => 'post']
        ];
---
SELECT * FROM `profile` WHERE `user_id`=2